{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/central_hub_zone.png","/#","^As you step into the bustling Central Hub, you marvel at the sheer scale of it all. People from all over the Celestial move about, going about their daily tasks. In the distance, you spot the familiar figure of your mother, who works as a coordinator in the Central Hub. You can't help but smile, thinking about how she always finds time for you despite her busy schedule.","\n","ev","str","^Walk over to your mother and greet her.","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"start.0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Explore the Central Hub and introduce yourself to a stranger.",{"->":"$r","var":true},null]}],["ev",{"^->":"start.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Head to the Communication Center and meet the person in charge.",{"->":"$r","var":true},null]}],{"c-0":["\n",{"->":"greet_mom"},{"#f":5}],"c-1":["ev",{"^->":"start.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"greet_alex"},"end",{"#f":5}],"c-2":["ev",{"^->":"start.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":"greet_jordan"},{"#f":5}]}],{"#f":1}],"greet_mom":["#","^npc: mother","/#","^As you approach your mother, she notices you and her face lights up with a warm smile. \"Oh, there you are! It's always a pleasure to see you here. How's your day going? Is there anything I can help you with?\"","\n","end",{"#f":1}],"greet_alex":["#","^npc: alex","/#","^You decide to venture further into the Central Hub and meet new people. As you wander, you come across an interesting individual named Alex, who is busy working on a complex holographic display. \"Hi, I'm Alex. I work on monitoring and analyzing the ship's systems. Nice to meet you!\"","\n","end",{"#f":1}],"greet_jordan":["#","^npc: jordan","/#","^Curious about the Communication Center, you head in that direction. As you enter, you're greeted by a friendly face named Jordan. \"Hello! I'm Jordan, the Communication Center's supervisor. It's nice to meet you! Is there anything specific you'd like to know about our work here?\"","\n","end",{"#f":1}],"global decl":["ev",0,{"VAR=":"timePlayer"},0,{"VAR=":"timeSinceLastRun"},0,{"VAR=":"totalVisits"},"/ev","end",null],"#f":1}],"listDefs":{}}