{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/central_hub_zone.png","/#","^As you step into the bustling Central Hub, you marvel at the sheer scale of it all. People from all over the Celestial move about, going about their daily tasks. In the distance, you spot the familiar figure of your mother, who works as a coordinator in the Central Hub. You can't help but smile, thinking about how she always finds time for you despite her busy schedule.","\n","ev","str","^Walk over to your mother and greet her.","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"start.0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Explore the Central Hub and introduce yourself to a stranger.",{"->":"$r","var":true},null]}],["ev",{"^->":"start.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Head to the Communication Center and meet the person in charge.",{"->":"$r","var":true},null]}],{"c-0":["\n",{"->":"greet_mom"},{"#f":5}],"c-1":["ev",{"^->":"start.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"greet_alex"},"end",{"#f":5}],"c-2":["ev",{"^->":"start.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":"greet_jordan"},{"#f":5}]}],{"#f":1}],"greet_mom":[["#","^npc: mother","/#","^You find your mother, Maria, in her office, focused intently on her work. As soon as she sees you, her face lights up, and she welcomes you with open arms.","\n","^Mother: \"Oh, dear! What a pleasant surprise! I'm so happy to see you. How have you been? Are you finding your way around the ship and settling in?\"","\n","ev","str","^\"Yes, everything's going well. I'm enjoying exploring the different districts and meeting new people.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"To be honest, I'm feeling a bit overwhelmed. There's so much to see and do.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"I'm not sure yet. I'm still trying to figure out what I want to do and where I want to go.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Maria smiles warmly. \"That's wonderful to hear. I'm so proud of you for embracing this journey and making the most of the opportunities that come your way. Remember, you can always count on me for support and advice.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Maria nods understandingly. \"It can be overwhelming at times, but don't worry, you'll find your footing soon enough. Just remember that it's okay to take things one step at a time and that I'm always here for you if you need help or advice.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Maria offers an encouraging smile. \"It's perfectly natural to feel uncertain at times. Exploring your options and discovering your passions is all part of the journey. Just know that I'm here to support you in any way I can.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^After a heartfelt conversation with your mother, you leave her office feeling reassured and grateful for her love and support. Knowing she's there for you, no matter what challenges you face, fills you with a sense of comfort and determination.","\n","ev","str","^Learn about another area on the ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^visit-central-hub-zone","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"greet_alex":[["#","^npc: alex","/#","^You decide to checkout the complex holographic display in the Central Hub, showcasing real-time data of the Celestial's various systems, as well as a 3D map of the surrounding space.","\n","^As you approach the holographic display, you spot Alax waving at you enthusiastically, their eyes sparkling with excitement.","\n","^Alax: \"Hey there! I'm glad you made it. This display is one of my favorite spots on the ship. It's incredible how it combines art and technology to provide vital information in such a visually appealing way.\"","\n","ev","str","^\"It's amazing! I've never seen anything like this before.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I can see why you like it, but I'm not sure I understand what everything represents.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"It's interesting, but I'm more curious about your work as an engineer. What do you do?\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Alax grins. \"Right? The engineers and artists who designed it did a fantastic job. There's always something new to discover, and I never get tired of watching it.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Alax nods. \"No worries! I'd be happy to give you a quick rundown of the display's features and how to interpret the data. It can be a bit overwhelming at first, but you'll get the hang of it in no time.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Alax smiles, clearly passionate about their work. \"I appreciate your interest! I work on maintaining and upgrading the ship's various systems, from life support to propulsion. It's a challenging job, but I love solving problems and knowing that my work helps keep the Celestial running smoothly.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^As you continue to chat with Alax, you can't help but feel inspired by their passion for engineering and their appreciation for the beauty of the holographic display. You leave the Central Hub with a newfound appreciation for the blend of art and technology that exists on the ship, as well as a deeper connection with your new friend, Alax.","\n","ev","str","^Learn about another area on the ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^meet-alex","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"greet_jordan":[["#","^npc: jordan","/#","^You decide to visit the Communication Center, intrigued by the idea of seeing how the Celestial maintains contact with the outside universe. As you enter the bustling room filled with advanced equipment, you notice a uniformed officer examining a console. The officer's name tag reads \"Jordan.\"","\n","^Jordan looks up from the console and notices your curiosity. They smile warmly and approach you.","\n","^Jordan: \"Hello there! It's not often we get visitors in the Communication Center. My name is Jordan. Can I help you with anything?\"","\n","ev","str","^\"I was just curious about how the Celestial communicates with other ships and stations. Can you tell me more about it?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I'm interested in learning more about your role as an officer. What do you do here?\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"This place seems so busy and complex. How do you keep up with everything?\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Jordan nods, enthusiasm lighting up their face. \"Of course! We use a combination of cutting-edge technologies, including quantum entanglement and subspace transmissions, to maintain real-time communication with other ships and stations. It's crucial for coordinating trade, research, and security efforts.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Jordan stands a little taller, clearly proud of their position. \"As an officer in the Celestial's communication division, my main responsibilities include monitoring incoming and outgoing transmissions, ensuring smooth communication with other vessels, and maintaining the integrity of our communication systems.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Jordan chuckles. \"It can be a bit overwhelming at times, but we have a great team here. We all work together to make sure everything runs smoothly. Plus, our state-of-the-art systems make it easier to manage the flow of information.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Your conversation with Jordan leaves you with a greater understanding of the importance of communication in the vastness of space. As you depart the Communication Center, you appreciate the hard work and dedication of the officers like Jordan who keep the Celestial connected to the rest of the universe.","\n","ev","str","^Learn about another area on the ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^meet-jordan","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"timePlayer"},0,{"VAR=":"timeSinceLastRun"},0,{"VAR=":"totalVisits"},"/ev","end",null],"#f":1}],"listDefs":{}}