{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/medical_zone.png","/#","^You enter the Health and Wellness District, a serene and inviting area of the ship dedicated to both physical and mental well-being. Here, you find a diverse array of facilities and practitioners, from medical professionals to therapists and fitness instructors. The soothing atmosphere, combined with the hum of conversation and the occasional sound of exercise equipment, creates a space where health and self-care are the primary focus.","\n","ev","str","^Visit the medical center for a routine check-up.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Check out the mental health and therapy center.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Explore the fitness center and join a workout class.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Relax in the meditation and yoga studio.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","^You decide to visit the medical center for a routine check-up. As you enter, you're greeted by a friendly nurse named Lila. \"Hello there, I'm Lila! It's great to see people taking an interest in their health. We're here to help with anything from minor ailments to more complex health concerns. If you have any questions or need assistance, just let me know!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Curious about the ship's mental health services, you make your way to the therapy center. As you walk in, you're greeted by a warm, compassionate therapist named Dr. Chen. \"Hi, I'm Dr. Chen. It's so important to take care of our mental well-being on this journey. We offer various therapy options, stress management workshops, and support groups. If you ever need someone to talk to, don't hesitate to reach out.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Eager to get some exercise, you head over to the fitness center. The center is bustling with activity, and a friendly fitness instructor named Jordan approaches you. \"Hey there, I'm Jordan! Welcome to our fitness center. We offer a wide range of classes and equipment for all skill levels. Whether you're a beginner or a seasoned athlete, we've got something for you. Feel free to ask me any questions or for recommendations.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^Seeking a moment of calm, you step into the meditation and yoga studio. The tranquil environment is a welcome respite from the bustling ship, and a gentle voice greets you. \"Namaste, I'm Aria. We offer a variety of yoga and meditation classes to help you find balance and inner peace. If you're new to the practice or just want to learn more, I'm here to guide you.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^The Health and Wellness District is a sanctuary for both body and mind, providing a supportive environment for the inhabitants of the Celestial to maintain and improve their well-being.","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"timePlayer"},0,{"VAR=":"timeSinceLastRun"},0,{"VAR=":"totalVisits"},"/ev","end",null],"#f":1}],"listDefs":{}}