{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/engine_zone.png","/#","^As you enter the engine room, the low hum of the ship's massive propulsion system fills the air. This area is the heart of the Celestial's movement and navigation, and it's filled with engineers and technicians working diligently to maintain and monitor the ship's performance. The maze of machinery, control panels, and conduits create an intricate, organized chaos.","\n","ev","str","^Ask a technician about the engine's maintenance schedule.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Inquire about the engine's fuel consumption and efficiency.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Observe a group of engineers troubleshooting a minor issue.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Ask about the future upgrades planned for the engine.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"engine_room"},{"#f":5}],"c-1":["\n",{"->":"engine_efficiency"},{"#f":5}],"c-2":["\n",{"->":"observe_group"},{"#f":5}],"c-3":["\n",{"->":"upgrade_plans"},{"#f":5}]}],{"#f":1}],"engine_room":[["#","^npc: alex","/#","ev","str","^meet-alex","/str",{"x()":"completedEvent","exArgs":1},0,">","/ev",{"temp=":"didMeetAlex"},"\n","^Upon entering the dimly lit, cavernous engine room, you found yourself marveling at the intricate network of pipes, gears, and blinking lights that appeared to be the very beating heart of the Celestial. The air hummed with the vibrations of the colossal engine, as if a thousand tiny imps were diligently whirring away in unison to keep the vessel afloat.","\n","^In your quest to unravel the mysteries of this mechanical marvel, you approach ","ev",{"VAR?":"didMeetAlex"},"/ev",[{"->":".^.b","c":true},{"b":["^  a familiar face - a technician you had seen before in the Central Hub.",{"->":".^.^.^.20"},null]}],"nop","^ The technician, Alex, looked up from their work as you neared, a smile blooming across their grease-streaked face.","\n","^\"Ahoy there, curious wanderer!\" Alex exclaimed, wiping their hands on a well-worn cloth. \"","ev",{"VAR?":"didMeetAlex"},"/ev",[{"->":".^.b","c":true},{"b":["^ Fancy meeting you here again!",{"->":".^.^.^.28"},null]}],"nop","^ I'm Alex, the humble caretaker of this magnificent beast we call an engine. We adhere to a strict maintenance routine here, ensuring that every cog and piston runs in perfect harmony. Each component has its own set of tasks, and we follow a detailed checklist that would make even the most pedantic librarian blush.\"","\n","^Sensing your interest, Alex continued, \"If you'd like to delve deeper into the world of engine maintenance, I'd be more than happy to guide you on a behind-the-scenes tour.\"","\n","ev","str","^Accept Alex's offer and embark on a guided tour of the engine room, learning about the inner workings of the Celestial's mechanical heart.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Inquire about any ongoing issues or challenges faced by the engine room technicians, hoping to gain insight into the less glamorous aspects of their work.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Discuss the role of the engine in the Celestial's day-to-day operations and how its performance impacts the lives of the vessel's inhabitants.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Thank Alex for their time but decide to explore the engine room independently, observing the various technicians as they conduct their work.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Your encounter with Alex and the engine room left you with a newfound appreciation for the sheer complexity and precision required to keep the Celestial running smoothly. As you exited the engine room, the steady hum of the mighty engine reverberated through the corridors, a comforting reminder of the dedicated team working tirelessly to maintain the vessel's lifeblood.","\n","ev",{"VAR?":"didMeetAlex"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^meet-alex-again","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["\n","ev","str","^meet-alex-first-engine","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n",{"->":".^.^.^.7"},null]}],"nop","\n","ev","str","^It's been a long day, time to go home.","/str",{"VAR?":"timePlayer"},2,">=","/ev",{"*":".^.c-4","flg":21},"ev","str","^Reluctantly go learn about another area.","/str",{"VAR?":"timePlayer"},2,"<","/ev",{"*":".^.c-5","flg":21},{"c-4":["\n","ev","str","^dialog","/str","str","^dialog-day-two","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"c-5":["\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"engine_efficiency":[["#","^npc: priya","/#","^As you wandered through the engine room, your curiosity piqued by the ship's energy efficiency, you spotted a nearby engineer meticulously monitoring the fuel levels on a glowing screen. The engineer's gaze flitted between various charts and graphs, her fingers deftly dancing across the controls.","\n","^Venturing closer, you decided to strike up a conversation about the Celestial's fuel consumption and overall sustainability. The engineer, named Priya, looked up from her work and greeted you with a warm smile.","\n","^\"Ah, hello there!\" Priya exclaimed, her eyes sparkling with enthusiasm. \"I'm Priya, and I'm delighted to meet someone else who's interested in the finer points of energy efficiency! The Celestial's engines are the pinnacle of cutting-edge technology, designed to minimize fuel consumption without sacrificing performance.\"","\n","^Her voice brimming with pride, she continued, \"Of course, there's always room for improvement, and we're constantly tinkering away to make our ship even more sustainable. If you have any questions or want to delve into the nitty-gritty details, just let me know!\"","\n","ev","str","^Ask Priya about the specific technologies used in the Celestial's engines that contribute to its energy efficiency.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Inquire about any ongoing projects or research aimed at further improving the ship's fuel consumption and sustainability.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Discuss the implications of energy efficiency for the Celestial's overall mission and the well-being of its inhabitants.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Thank Priya for the information and continue exploring the engine room, reflecting on the importance of sustainability in the ship's design.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^As your conversation with Priya unfolded, you found yourself engrossed in the complex world of energy efficiency and the tireless efforts of the engineers who worked to ensure that the Celestial remained a shining example of sustainable technology.","\n","ev","str","^meet-priya","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^It's been a long day, time to go home.","/str",{"VAR?":"timePlayer"},2,">=","/ev",{"*":".^.c-4","flg":21},"ev","str","^Reluctantly go learn about another area.","/str",{"VAR?":"timePlayer"},2,"<","/ev",{"*":".^.c-5","flg":21},{"c-4":["\n","ev","str","^dialog","/str","str","^dialog-day-two","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"c-5":["\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"observe_group":[["#","^npc: marcus","/#","^As you meandered through the engine room, your attention was drawn to a group of engineers huddled around a control panel, their faces etched with concentration. Sensing a learning opportunity, you decided to observe their troubleshooting process from a respectful distance.","\n","^Murmured discussions were punctuated by the occasional beep or whirr of machinery as the engineers worked diligently to resolve the issue at hand. With a final flourish of activity, the control panel emitted a satisfying chime, and the group's collective tension seemed to dissipate.","\n","^Noticing your presence, one of the engineers - a tall, lanky fellow with a hint of a grin - turned to face you and extended a friendly hand. \"Hey there, I'm Marcus!\" he said cheerfully. \"Good timing on your part - you just witnessed us fixing a small glitch in the system. It's all part of the job around here!\"","\n","^He gestured expansively at the surrounding machinery before continuing, \"If you want to learn more about what we do or maybe even pick up some troubleshooting tips, feel free to ask. We're always happy to share our knowledge!\"","\n","ev","str","^Ask Marcus about the specific issue they just resolved and what steps they took to fix it.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Inquire about the most common types of glitches they encounter and how they prioritize repairs.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Discuss the importance of teamwork and collaboration among the engineers in the engine room.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Thank Marcus for the offer and continue exploring the engine room, fascinated by the intricate dance of troubleshooting and problem-solving that kept the Celestial running smoothly.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^As you chatted with Marcus, you couldn't help but admire the ingenuity and dedication of the engineers who ensured that the heart of the Celestial beat steadily, even in the face of unexpected challenges.","\n","ev","str","^meet-marcus","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^It's been a long day, time to go home.","/str",{"VAR?":"timePlayer"},2,">=","/ev",{"*":".^.c-4","flg":21},"ev","str","^Reluctantly go learn about another area.","/str",{"VAR?":"timePlayer"},2,"<","/ev",{"*":".^.c-5","flg":21},{"c-4":["\n","ev","str","^dialog","/str","str","^dialog-day-two","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"c-5":["\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"upgrade_plans":[["#","^npc: sophia","/#","^Wandering deeper into the engine room, your gaze was drawn to a senior engineer meticulously examining a set of blueprints spread across a nearby table. The diagrams and schematics hinted at potential upgrades that could further enhance the engine's performance. Intrigued by the possibilities, you approached the engineer, hoping to learn more.","\n","^The engineer, a woman with a steely gaze and an aura of determination, looked up from her work and greeted you with a warm smile. \"Hello, I'm Sophia!\" she said, extending a hand in welcome. \"We're always researching and planning enhancements for the Celestial's engines to ensure we're at the forefront of technology. If you're curious about our plans, I'd be more than happy to discuss them with you.\"","\n","ev","str","^Ask Sophia about the most significant upgrades they're currently considering for the Celestial's engines.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Inquire about the process of implementing engine upgrades and how they balance innovation with the need for reliability.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Discuss the role of environmental sustainability in the development of new engine technologies.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Thank Sophia for the offer and continue exploring the engine room, marveling at the ceaseless pursuit of progress that propelled the Celestial ever forward.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^As you conversed with Sophia, you gained a newfound appreciation for the dedication and ingenuity of the engineers who continually pushed the boundaries of technology, ensuring that the Celestial remained a beacon of innovation and excellence on its journey through the stars.","\n","ev","str","^meet-sophia","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^It's been a long day, time to go home.","/str",{"VAR?":"timePlayer"},2,">=","/ev",{"*":".^.c-4","flg":21},"ev","str","^Reluctantly go learn about another area.","/str",{"VAR?":"timePlayer"},2,"<","/ev",{"*":".^.c-5","flg":21},{"c-4":["\n","ev","str","^dialog","/str","str","^dialog-day-two","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"c-5":["\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"timePlayer"},0,{"VAR=":"timeSinceLastRun"},0,{"VAR=":"totalVisits"},"/ev","end",null],"#f":1}],"listDefs":{}}