{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/residential_zone.png","/#","^As you enter the Residential Districts, you're surrounded by the comfortable and familiar hum of daily life on the Celestial. This district is home to countless families and individuals who have made their lives within the confines of the ship, turning it into a vibrant and diverse community.","\n","ev","str","^Attend a neighborhood meeting and meet the local community leader.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Visit a nearby park and strike up a conversation with a friendly local.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Drop by a local café and chat with the barista.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^You decide to attend a neighborhood meeting, where you're introduced to the local community leader, Helen. \"Welcome! I'm Helen, the community leader for this area. Our neighborhood meetings are a great way to get involved, voice your concerns, and meet your fellow residents. If you have any questions about the community, please don't hesitate to ask!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You choose to visit a nearby park, where you come across a friendly local named Carlos. \"Hey there, I'm Carlos. I've been living in this district for quite some time now. It's a great place to call home, with lots of friendly faces and a strong sense of community. If you have any questions about the area or need help finding your way around, just let me know!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^You decide to drop by a local café, where the aroma of freshly brewed coffee and warm pastries welcomes you. The friendly barista, Sarah, greets you with a smile. \"Hi, I'm Sarah. Welcome to our café! This is a favorite spot for locals to gather, catch up, and unwind. If you have any questions about the Residential Districts or just need a recommendation for a delicious beverage, feel free to ask!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^The Residential Districts offer a sense of belonging and warmth, providing a nurturing environment for the people living on the Celestial as they navigate their lives in the vast expanse of space.","\n","ev","str","^visit-residential-zone","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^It's been a long day, time to go home.","/str",{"VAR?":"timePlayer"},2,">=","/ev",{"*":".^.c-3","flg":21},"ev","str","^Reluctantly go learn about another area.","/str",{"VAR?":"timePlayer"},2,"<","/ev",{"*":".^.c-4","flg":21},{"c-3":["\n","ev","str","^dialog","/str","str","^dialog-day-two","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"c-4":["\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"timePlayer"},0,{"VAR=":"timeSinceLastRun"},0,{"VAR=":"totalVisits"},"/ev","end",null],"#f":1}],"listDefs":{}}