{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["#","^background: ship/agricultural_zone.png","/#","^You arrive at the lush Agricultural Zone, a vast area filled with greenery, crops, and plant life that sustains the ship's population. The soft hum of the artificial sunlight panels and the sound of water trickling in the hydroponic systems create a soothing atmosphere.","\n","ev","str","^Look at the plants","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Checkout the Hydroponics","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Measure a sunlight panel output","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"admire_plants"},{"#f":5}],"c-1":["\n",{"->":"hydroponics"},{"#f":5}],"c-2":["\n",{"->":"sunpanel"},{"#f":5}]}],{"#f":1}],"admire_plants":[["#","^npc: riley","/#","^As you admire the vibrant plants, you spot your old friend, Riley, who is tending to a row of vegetables. Riley notices you and waves enthusiastically.","\n","^Riley: \"Hey there! It's been a while since we last caught up. How have you been?\"","\n","ev","str","^\"I'm doing well, excited to start this new journey!\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I've been a bit nervous, to be honest.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^It's been a bit of a whirlwind, but I'm ready for the challenge.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Riley smiles warmly. \"That's fantastic! We can definitely use your skills and enthusiasm around here.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Riley gives you an understanding nod. \"It's natural to feel that way, but I'm sure you'll do great. We're here to support each other.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Riley chuckles. \"That's the spirit! We'll face these challenges together, my friend.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Riley: \"Anyway, let me show you around. The Agricultural Zone is not only responsible for growing food but also maintaining the ship's oxygen and water recycling systems. There's a lot to learn, but don't worry, I'll guide you through everything.\"","\n","^As you follow Riley, you feel a sense of camaraderie and purpose. With an old friend by your side, you're eager to contribute to the well-being of the Celestial and its inhabitants.","\n","ev","str","^Spend time in another part of the Ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^meet-riley","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"hydroponics":[["#","^npc: morgan","/#","^You make your way to the hydroponics section of the Agricultural Zone, eager to learn more about the advanced techniques used to grow plants in the Celestial. As you examine the intricate system of tubes and trays, you notice a familiar face approaching: your former rival, Morgan.","\n","^Morgan: \"Well, well, look who's finally decided to join the Agricultural Zone. Didn't think I'd see you here, but I guess life is full of surprises.\"","\n","ev","str","^Good to see you too, Morgan. I'm just here to learn and contribute.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I'm here to show you that I can excel in this field too.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Don't worry, Morgan. I won't let our history get in the way of our work.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Morgan raises an eyebrow. \"Huh, I didn't expect that response. Maybe we can set our rivalry aside and work together.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Morgan smirks. \"I wouldn't expect anything less from you. Let's see if you can keep up.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Morgan nods, looking somewhat impressed. \"That's very mature of you. We've got a job to do, after all.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Morgan: \"Alright then, let's see what you've got. I'll be keeping an eye on you, so don't disappoint me.\"","\n","^As Morgan walks away, you feel a mix of excitement and determination. While your past rivalry may linger, you're committed to proving yourself and making a positive impact in the Agricultural Zone and on the Celestial as a whole.","\n","ev","str","^Learn about a different part of the Ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^meet-morgan","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"sunpanel":[["#","^npc: riley","/#","^You find yourself at the Agricultural Zone, admiring the artificial sunlight panels that provide essential light for the plants. Eager to make an impact, you decide to take some measurements to ensure the panels are operating at optimal efficiency.","\n","^As you diligently examine the panels, Riley walks over and catches you in the act. With a playful grin, Riley teases you.","\n","^Riley: \"Well, someone's eager to make a difference! I barely had a chance to say hello before you started measuring the sun panels.\"","\n","ev","str","^You know me, always ready to dive in!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I just wanted to make sure everything's running smoothly.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I couldn't help myself. I'm fascinated by these panels!","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^Riley chuckles. \"That's what I admire about you. Your enthusiasm is contagious!\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^Riley nods appreciatively. \"Your attention to detail is really valuable around here.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Riley's eyes light up. \"I'm glad you're so interested! There's a lot to learn, and I'd be happy to teach you more.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Riley: \"Once you've finished up here, come find me, and we can catch up. It's great to have you on board, and I'm looking forward to working together!\"","\n","^As Riley walks away, you feel motivated by their playful encouragement. Your diligence and enthusiasm are bound to make a positive impact on the Agricultural Zone and the Celestial as a whole.","\n","ev","str","^Look for more friends around the ship.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n","ev","str","^meet-riley-flirty","/str",{"x()":"triggerEvent","exArgs":1},"pop","/ev","\n","ev","str","^ship","/str","str","^dialog-intro","/str",{"x()":"nextPage","exArgs":2},"pop","/ev","\n","end",{"#f":5}],"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}